namespace CarMarket.Web.Models
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Web;
    using System.Web.Mvc;

    public static class AppHelper
    {
        public static readonly Dictionary<string, string> AreasList = new Dictionary<string, string>
        {
            { "1", "София" },
            { "2", "Пловдив" },
            { "3", "Варна" },
            { "4", "Бургас" },
            { "5", "Разград" },
            { "6", "Русе" },
            { "7", "Силистра" },
            { "8", "Сливен" },
            { "9", "Смолян" },
            { "10", "Софийска" },
            { "11", "Стара Загора" },
            { "12", "Търговище" },
            { "13", "Хасково" },
            { "14", "Шумен" },
            { "15", "Благоевград" },
            { "16", "Плевен" },
            { "17", "Велико Търново" },
            { "18", "Видин" },
            { "19", "Враца" },
            { "20", "Габрово" },
            { "21", "Добрич" },
            { "22", "Кърджали" },
            { "23", "Кюстендил" },
            { "24", "Ловеч" },
            { "25", "Монтана" },
            { "26", "Пазарджик" },
            { "27", "Перник" },
            { "28", "Ямбол" },
        };

        public static readonly Dictionary<string, Dictionary<string, string>> CitiesList = new Dictionary<string, Dictionary<string, string>>
        {
            { "1", new Dictionary<string, string> { { "1", "София" }, { "2", "Лозен" } } },
            { "2", new Dictionary<string, string> { { "3", "Съединение" }, { "4", "Пловдив" }, { "5", "Асеновград" }, { "6", "Карлово" }, { "7", "Първомай" }, { "8", "Труд" }, { "9", "Сопот" }, { "10", "Стамболийски" }, { "11", "Хисаря" } } },
            { "3", new Dictionary<string, string> { { "12", "Варна" }, { "13", "Каварна" }, { "14", "Провадия" } } },
            { "4", new Dictionary<string, string> { { "15", "Бургас" }, { "16", "Айтос" }, { "17", "Карнобат" }, { "18", "Несебър" }, { "19", "Созопол" }, { "20", "Средец" } } },
            { "5", new Dictionary<string, string> { { "21", "Исперих" }, { "22", "Кубрат" }, { "23", "Разград" } } },
            { "6", new Dictionary<string, string> { { "24", "Бяла" }, { "25", "Две могили" }, { "26", "Русе" } } },
            { "7", new Dictionary<string, string> { { "27", "Силистра" }, { "28", "Тутракан" } } },
            { "8", new Dictionary<string, string> { { "29", "Нова Загора" }, { "30", "Сливен" } } },
            { "9", new Dictionary<string, string> { { "31", "Златоград" }, { "32", "Мадан" }, { "33", "Смолян" } } },
            { "10", new Dictionary<string, string> { { "34", "Ботевград" }, { "35", "Елин Пелин" }, { "36", "Етрополе" }, { "37", "Ихтиман" }, { "38", "Костенец" }, { "39", "Костинброд" }, { "40", "Пирдоп" }, { "41", "Правец" }, { "42", "Самоков" }, { "43", "Своге" } } },
            { "11", new Dictionary<string, string> { { "44", "Казанлък" }, { "45", "Стара Загора" } } },
            { "12", new Dictionary<string, string> { { "46", "Попово" }, { "47", "Търговище" } } },
            { "13", new Dictionary<string, string> { { "48", "Димитровград" }, { "49", "Ивайловград" }, { "50", "Любимец" }, { "51", "Свиленград" }, { "52", "Харманли" }, { "53", "Хасково" } } },
            { "14", new Dictionary<string, string> { { "54", "Нови пазар" }, { "55", "Шумен" } } },
            { "15", new Dictionary<string, string> { { "56", "Банско" }, { "57", "Благоевград" }, { "58", "Гоце Делчев" }, { "59", "Мелник" }, { "60", "Петрич" }, { "61", "Разлог" }, { "62", "Сандански" } } },
            { "16", new Dictionary<string, string> { { "63", "Белене" }, { "64", "Левски" }, { "65", "Плевен" }, { "66", "Червен Бряг" } } },
            { "17", new Dictionary<string, string> { { "67", "Велико Търново" }, { "68", "Горна Оряховица" }, { "69", "Елена" }, { "70", "Лясковец" }, { "71", "Свищов" } } },
            { "18", new Dictionary<string, string> { { "72", "Видин" } } },
            { "19", new Dictionary<string, string> { { "73", "Бяла Славина" }, { "74", "Враца" }, { "75", "Козлодуй" }, { "76", "Мездра" } } },
            { "20", new Dictionary<string, string> { { "77", "Габрово" }, { "78", "Дряново" }, { "79", "Севлиево" }, { "80", "Трявна" } } },
            { "21", new Dictionary<string, string> { { "81", "Балчик" }, { "82", "Генерал Тошево" }, { "83", "Добрич" } } },
            { "22", new Dictionary<string, string> { { "84", "Крумовград" }, { "85", "Кърджали" }, { "86", "Момчилград" } } },
            { "23", new Dictionary<string, string> { { "87", "Дупница" }, { "88", "Кюстендил" } } },
            { "24", new Dictionary<string, string> { { "89", "Ловеч" }, { "90", "Луковит" }, { "91", "Тетевен" }, { "92", "Троян" } } },
            { "25", new Dictionary<string, string> { { "93", "Берковица" }, { "94", "Лом" }, { "95", "Монтана" } } },
            { "26", new Dictionary<string, string> { { "96", "Белово" }, { "97", "Велинград" }, { "98", "Пазарджик" }, { "99", "Панагюрище" }, { "100", "Пещера" }, { "101", "Септември" } } },
            { "27", new Dictionary<string, string> { { "102", "Драгичево" }, { "103", "Перник" }, { "104", "Радомир" } } },
            { "28", new Dictionary<string,  string> { { "105", "Ямбол" } } },
        };
    }
}